{"inkVersion":21,"root":[["^William: “Now that the river’s all cleaned up, the animals have finally come back!”","\n","^William: “I’m sure they’ll be happy to have some clean water.”","\n","^Player: “I would be too! I’m just glad the environment is finally back to normal.”","\n","^William: “Not so fast!”","\n","^William: “You see, not all of these animals are native to this area.”","\n","^William: “The invasive species that have found their way here can end up doing more harm than good to the environment.”","\n","^William: “And we definitely don’t want to reverse all of that hard work you just did!”","\n","^Player: “Oh, I see… well, what do we do now then?”","\n","^William: “Let's keep an eye out for those invasive species–if we can trap them, we can relocate them somewhere more suitable.”","\n","^William: “It’ll help this environment and the animals that don’t belong!”","\n","^William: “Two birds with one stone, if you will! Ohohoho!”","\n","^William: “Head to the designated trapping site, and I’ll instruct you further there.”","\n","^Player: “Okay!”","\n","^William: “Alright!\"","\n",["ev",{"^->":"0.28.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-0","flg":18},{"s":["^Yes",{"->":"$r","var":true},null]}],["ev",{"^->":"0.29.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-1","flg":18},{"s":["^No",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"0.28.s"},[{"#n":"$r2"}],"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["ev",{"^->":"0.c-1.$r2"},"/ev",{"temp=":"$r"},{"->":"0.29.s"},[{"#n":"$r2"}],"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["^William: \"Time to get trappin’.”","\n","^William: “To capture the animals, click on the correct ones as they pass by.”","\n","^William: “Try to capture 30* invasive species from the area so we can relocate them!”","\n","^William: “If you’re not sure which animals are invasive, check that handy Guidebook of yours.”","\n","^William: “Good luck!”","\n",["done",{"#f":5,"#n":"g-1"}],{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}